LDV-Esport/app/Http/Controllers/TournamentsPublicController.php

    public function index()
    {
        $tournois = SoloTournament::all();
---
select * from `solo_tournaments`